"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите два варианта решения: через list и через dict.

Пример:
Введите номер месяца: 10
Результат через список: Осень
Результат через словарь: Осень
"""
season_lst = ["0", "Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето",
              "Лето", "Осень", "Осень", "Осень", "Зима"]
seasons_dict = {"Зима": (1, 2, 12),
                "Весна": (3, 4, 5),
                "Лето": (6, 7, 8),
                "Осень": (9, 10, 11)}
month = int(input("Введите номер месяца: "))

if month in range(1, 13):
    print(f"Результат через список: {season_lst[month]}")
    for key in seasons_dict.keys():
        if month in seasons_dict[key]:
            print(f"Результат через словарь: {key}")
else:
    print("Введен некорректный номер месяца!")
