"""
5. Реализовать структуру «Рейтинг», представляющую собой не
возрастающий набор натуральных чисел
(каждый элемент ряда меньше или равен предыдущему).

У пользователя необходимо запрашивать новый элемент рейтинга.
Если в рейтинге существуют элементы с одинаковыми значениями,
то новый элемент с тем же значением должен разместиться после них.

Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.

Набор натуральных чисел можно задать непосредственно в коде,
например, my_list = [7, 5, 3, 3, 2].
"""
init_lst = [7, 5, 3, 3, 2]
print(f"Текущий рейтинг: {init_lst}")
for i in init_lst:
    new_el = int(input("Введите новый элемент рейтинга: "))
    if new_el > 0:
        init_lst.append(new_el)
        init_lst.sort(reverse=True)
        print(f"Новый рейтинг: {init_lst}")
else:
    print("Ошибка. Вы ввели не натуральное число")
