"""
3. Создать текстовый файл (не программно), построчно записать фамилии
сотрудников
и величину их окладов (не менее 10 строк). Определить, кто из сотрудников
имеет оклад менее 20 тыс.,
вывести фамилии этих сотрудников. Выполнить подсчет средней величины дохода
сотрудников.
Пример файла:

Иванов 23543.12
Петров 13749.32
"""
# Задаём начальные параметры
i = 0
lines = 0
sal_tot = 0

# Открываем и читаем исходный файл построчно
with open("file_4.txt", "r", encoding="utf-8") as file:
    for line in file:
        i += 1
        lines += 1
        name, salary = line.split()
        sal = float(salary)
        sal_tot += sal
        if sal < 20000:
            print(name, salary)

print("Количество сотрудников: ", lines)
print("Средняя зарпалата: ", round(sal_tot / lines, 2))
