"""
6. Реализовать функцию int_func(), принимающую слово из маленьких
латинских букв и возвращающую его же, но с прописной первой буквой.
Например, print(int_func(‘text’)) -> Text.

Продолжить работу над заданием. В программу должна попадать строка из слов,
разделенных пробелом. Каждое слово состоит из латинских букв в нижнем регистре.
Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной
буквы.
Необходимо использовать написанную ранее функцию int_func().
"""


# Функция капитализации первых букв в словах
def int_func(text):
    print(text.title())
    return text.title()


# Определяем начальный список
out = []
# Запрос для пользователя
for word in input('Введите слова через пробел: ').split(' '):
    out.append(int_func(word))
# Выводим конечный результат
print(f"Строка с заглавными буквами: {' '.join(out)}")
