"""
7. Реализовать генератор с помощью функции с ключевым словом yield,
 создающим очередное значение.

 При вызове функции должен создаваться объект-генератор.
 Функция должна вызываться следующим образом: for el in fact(n).
 Функция отвечает за получение факториала числа,
 а в цикле необходимо выводить только первые n чисел, начиная с 1! и до n!.

Подсказка: факториал числа n — произведение чисел от 1 до n.
Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.
"""


def fact(num):
    """
    Функция вычисления факториала
    :param num: число, факториал которого вычисляем
    :return: расчётное значение (факториал)
    """
    strt = 1
    for i in range(1, num + 1):
        strt *= i
        yield strt


n_fct = int(input("Введите челое положительное число: "))
B = 1
for el in fact(n_fct):
    print(f"{B}! = {el}")
    B += 1
