"""
Задание 2.

Пользователь вводит время в секундах.
Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс.
Используйте форматирование строк.

Пример:
Введите время в секундах: 3600
Время в формате ч:м:с - 1.0 : 60.0 : 3600
"""
n = int(input("Введите время в секундах: "))
h = float(n/3600)
m = float(n/60)
s = int(n)
print(f"Время в формате ч : м : с - {round(h, 2)} : {round(m, 2)} : {s}")
