"""
5)	Создать (программно) текстовый файл, записать в него программно набор
чисел,
 разделенных пробелами. Программа должна подсчитывать сумму чисел в файле и
 выводить ее на экран.
"""

# Создаём исходный файл построчно
with open("file_5.txt", "w", encoding="utf-8") as file:
    line = input('Введите цифры через пробел: ')
    file.writelines(line)
    nums = line.split()

    print(sum(map(int, nums)))