"""
7)	Создать вручную и заполнить несколькими строками текстовый файл, в котором
каждая строка должна содержать данные о фирме: название, форма собственности,
выручка, издержки.
Пример строки файла: firm_1   ООО   10000   5000.
Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также
 среднюю прибыль. Если фирма получила убытки, в расчет средней прибыли ее не
 включать.
Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями,
 а также словарь со средней прибылью. Если фирма получила убытки, также
 добавить ее в словарь (со значением убытков).
Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000},
{“average_profit”: 2000}].
Итоговый список сохранить в виде json-объекта в соответствующий файл.
Пример json-объекта:
[{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
Подсказка: использовать менеджер контекста.
"""

import json

# Задаём начальные параметры
profit = {}
i = 0
tot_prof = 0
profit_aver = 0
pr = {}

# Открываем и читаем исходный файл построчно
with open("file_7.txt", "r", encoding="utf-8") as file:
    for line in file:
        # Передаём данные в словарь
        c_name, c_type, c_rev, c_cost = line.split()
        profit[c_name] = int(c_rev) - int(c_cost)
        tot_prof = tot_prof + profit.setdefault(c_name)
        i += 1
    if i != 0:
        profit_aver = tot_prof / i
        print(f"Средняя прибыль: {profit_aver:.2f}")
        pr_avr = {"Средняя прибыль": round(profit_aver)}
        profit.update(pr_avr)
        print(f"Прибыль каждой компании: {profit} ")

# Записываем данные в файл json
with open("file_7.json", "w", encoding="utf-8") as write_json:
    json.dump(profit, write_json)
    js_in = json.dumps(profit)
